MyHome/src/DataProcessors/ЗагрузкаБанковскихВыписок/ЗагрузкаБанковскихВыписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаБанковскихВыписок</name>
  <attributes>
    <name>ФайлДляЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗагрузки</name>
    <type>
      <types>EnumRef.ВариантыЗагрузкиБанковскихВыписок</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранитьСоответствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеВыписки</name>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МСС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДляСозданияДокументов</name>
    <attributes>
      <name>Обрабатывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходовРасходов</name>
      <type>
        <types>String</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <type>
        <types>Characteristic.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидыДвиженийДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <types>DocumentRef.РегистрацияРасходов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

MyHome/src/DataProcessors/ЗагрузкаБанковскихВыписок/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НомерТекущегоШага = 1;
	МаксимальноеКоличествоШагов = 4;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлДляЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма);
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШагНазад(Команда)
	ПерейтиНаШаг(-1);
КонецПроцедуры

&НаКлиенте
Процедура ШагВперед(Команда)
		
	Если НомерТекущегоШага = МаксимальноеКоличествоШагов Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	Если НЕ МожноПереходитьКСледующемуШагу() Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиНаШаг(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДляСозданияВыделитьВсе(Команда)
	УстановитьОтметкуСтрокТаблицыДляСоздания(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДляСозданияСнятьОтметкуУВсех(Команда)
	УстановитьОтметкуСтрокТаблицыДляСоздания(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ФайлДляЗагрузки = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаШаг(Шаг)
	
	СледующийШаг = НомерТекущегоШага + Шаг;
	
	Если СледующийШаг = 2 Тогда
		ПрочитатьФайлИЗаполнитьТаблицуДанных();
	ИначеЕсли СледующийШаг = 3 Тогда
		ЗаполнитьТаблицуСозданияДокументов();
	ИначеЕсли СледующийШаг = 4 Тогда
		СоздатьДокументыДвиженийДС();
	Иначе
	КонецЕсли;
	
	НомерТекущегоШага = СледующийШаг;
	
	ИмяСтраницы = "ГруппаШаг" + НомерТекущегоШага;
	Элементы.ГруппаШаги.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
	УстановитьВидимостьКнопокШагов();
	
КонецПроцедуры

Процедура СоздатьДокументыДвиженийДС()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СформироватьДокументы();
	ЗначениеВРеквизитФормы(ОбработкаОбъект.СозданныеДокументы, "Объект.СозданныеДокументы");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСозданияДокументов()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьТаблицуСозданияДокументов();
	ЗначениеВРеквизитФормы(ОбработкаОбъект.ТаблицаДляСозданияДокументов, "Объект.ТаблицаДляСозданияДокументов");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПрочитатьФайлИЗаполнитьТаблицуДанных()
	
	Файл = Новый Файл(Объект.ФайлДляЗагрузки);
	ПараметрыФайла = Новый Структура("Имя, ПолноеИмя, ИмяБезРасширения, Расширение, Путь");
	ЗаполнитьЗначенияСвойств(ПараметрыФайла, Файл);
	ДанныеФайла = Новый ДвоичныеДанные(Объект.ФайлДляЗагрузки);
	АдресХранилищаФайла = ПоместитьВоВременноеХранилище(ДанныеФайла);
		
	ПрочитатьФайлИЗаполнитьТаблицуДанныхНаСервере(ПараметрыФайла);
	
КонецПроцедуры

Процедура ПрочитатьФайлИЗаполнитьТаблицуДанныхНаСервере(ПараметрыФайла)
	
	ПараметрыЧтения = Новый Структура;
	ПараметрыЧтения.Вставить("АдресХранилищаФайла", АдресХранилищаФайла);
	ПараметрыЧтения.Вставить("ПараметрыФайла", ПараметрыФайла);
	ПараметрыЧтения.Вставить("ВариантЗагрузки", Объект.ВариантЗагрузки);
	
	ТаблицаДанных = Обработки.ЗагрузкаБанковскихВыписок.ПрочитатьДанныеФайла(ПараметрыЧтения);
	
	Объект.ДанныеВыписки.Загрузить(ТаблицаДанных);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКнопокШагов()
	
	Если НомерТекущегоШага = 1 Тогда
		Элементы.ШагВперед.Видимость = Истина;
		Элементы.ШагНазад.Видимость = Ложь;
		Элементы.ШагВперед.Заголовок = "Далее";
	ИначеЕсли НомерТекущегоШага = МаксимальноеКоличествоШагов Тогда
		Элементы.ШагВперед.Видимость = Истина;
		Элементы.ШагНазад.Видимость = Истина;
		Элементы.ШагВперед.Заголовок = "Завершить";
	Иначе
		Элементы.ШагВперед.Видимость = Истина;
		Элементы.ШагНазад.Видимость = Истина;
		Элементы.ШагВперед.Заголовок = "Далее";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция МожноПереходитьКСледующемуШагу()
	
	Если НомерТекущегоШага = 1 Тогда
		Возврат ВыполнитьПроверкиЗаполненияРеквизитовОбработки();
	КонецЕсли;
	
	Если НомерТекущегоШага = 3 Тогда
		Возврат ПроверитьЗаполнение();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьПроверкиЗаполненияРеквизитовОбработки()
	
	НетОшибок = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВариантЗагрузки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указан вариант загрузки",,, "Объект.ВариантЗагрузки");
		НетОшибок = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ФайлДляЗагрузки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указан файл выписки",, "", "Объект.ФайлДляЗагрузки");
		НетОшибок = Ложь;
	КонецЕсли;
	
	Возврат НетОшибок;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтметкуСтрокТаблицыДляСоздания(Отметка)
	
	Для каждого СтрокаТаблицы из Объект.ТаблицаДляСозданияДокументов Цикл
		СтрокаТаблицы.Обрабатывать = Отметка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
